In [1]:
pwd

'C:\\Users\\DHAVAL'

In [8]:
cd D:\Dhaval Web Development\Jupyter Notebook\Anil_Jupyter\Lab1

D:\Dhaval Web Development\Jupyter Notebook\Anil_Jupyter\Lab1

In [9]:
pwd

'D:\\Dhaval Web Development\\Jupyter Notebook\\Anil_Jupyter\\Lab1'

In [10]:
ls

 Volume in drive D is DHAVAL GOJIYA
 Volume Serial Number is 52FB-C5A3

 Directory of D:\Dhaval Web Development\Jupyter Notebook\Anil_Jupyter\Lab1

03/03/2022  09:19 PM    <DIR>          .
03/03/2022  09:19 PM    <DIR>          ..
03/03/2022  09:19 PM               254 Data_for_Transformation.csv
03/03/2022  09:19 PM             5,721 Lab_01_Linear_Algebra.ipynb
03/03/2022  09:19 PM             1,053 lab_01_linear_algebra.py
03/03/2022  09:19 PM            27,067 Lab_01_NLTK_Matplotlib.ipynb
03/03/2022  09:19 PM             2,277 lab_01_nltk_matplotlib.py
03/03/2022  09:19 PM            33,156 Lab_01_Pandas_Matplotlib.ipynb
03/03/2022  09:19 PM               766 lab_01_pandas_matplotlib.py
03/03/2022  09:19 PM             1,733 mtcars.csv
               8 File(s)         72,027 bytes
               2 Dir(s)  138,614,243,328 bytes free

In [11]:
import pandas as pd

In [12]:
data = pd.read_csv("Data_for_Transformation.csv")

In [15]:
data

    Country  Age  Salary Purchased
0    France   44   72000        No
1     Spain   27   48000       Yes
2   Germany   30   54000        No
3     Spain   38   61000        No
4   Germany   40   68000       Yes
5    France   35   58000       Yes
6     Spain   39   52000        No
7    France   48   79000       Yes
8   Germany   50   83000        No
9    France   37   67000       Yes
10    Spain   45   55000        No

In [17]:
data.replace("France", "Usa", inplace=True)

In [18]:
data

    Country  Age  Salary Purchased
0       Usa   44   72000        No
1     Spain   27   48000       Yes
2   Germany   30   54000        No
3     Spain   38   61000        No
4   Germany   40   68000       Yes
5       Usa   35   58000       Yes
6     Spain   39   52000        No
7       Usa   48   79000       Yes
8   Germany   50   83000        No
9       Usa   37   67000       Yes
10    Spain   45   55000        No

In [20]:
data.to_csv("Dhaval_NEW.csv")